package com.example.esdemotest.result;

/**
 * 异常代码
 * http 协议规范为主
 *
 * @author
 */
public enum ResponseCode {

    /**
     * 请求成功
     */
    CODE_200(200, "请求成功"),
    /**
     * 系统未捕获异常
     */
    CODE_400(400, "请求错误,请稍后重试"),
    /**
     * 并发异常 并发时可能出现此类异常，其下有若干子类异常来标识乐观锁和获取锁失败这两类异常信息
     */
    CODE_900(900, "请求过于频繁,请稍后再试"),
    CODE_901(901, "方法请求错误"),
    /**
     * 参数错误
     */
    CODE_1000(1000, "参数错误：{0}：{1}"),
    CODE_1001(1001, "参数错误"),
    CODE_1002(1002, "非法请求"),
    CODE_1003(1003, "请求失败，请重新操作"),
    CODE_1004(1004, "用户未登录"),
    CODE_1005(1005, "Token已过期"),
    CODE_1006(1006, "您没有足够权限操作，请联系管理员。"),
    CODE_1007(1007, "用户不存在，或者没有操作权限"),
    CODE_1009(1009, "密码输入不正确，还可以输入{0}次"),
    CODE_1010(1010, "您手机号码未注册，请使用手机验证码登录"),
    CODE_1011(1011, "操作失败，请稍后重试"),
    CODE_1012(1012, "未关联账户。"),
    CODE_1013(1013, "验证码不正确，请重新获取验证码"),
    CODE_1014(1014, "userInfo为null"),
    CODE_1018(1018, "您的账号存在异常操作已被平台冻结！如有疑问，请联系客服。"),
    CODE_1019(1019, "找不到对应的url请仔细核对,或者参数错误"),
    CODE_1102(1102, "短信发送过于频繁，请稍后再试"),
    CODE_1311(1311, "密码不正确超过{0}次，请{1}分钟后重新登录"),
    CODE_1312(1312, "请求错误，错误日志：{0}"),
    CODE_1313(1313, "用户账户初始化失败，请联系客服，或稍后重试"),
    CODE_1314(1314, "方法执行异常"),
    CODE_1315(1315, "请输入正确的手机号码"),
    CODE_1316(1316, "请输入手机号码"),
    CODE_1317(1317, "已经是注册用户了"),
    CODE_1318(1318, "密码由6~20位英文字母、数字组成"),
    CODE_1319(1319, "推荐码不存在"),
    CODE_2101(2101, "网易云信请求错误"),
    CODE_2102(2102, "网易云请求超时"),
    CODE_2206(2206, "预付单生成失败"),
    CODE_2207(2207, "微信信息错误"),
    CODE_2208(2208, "该手机号码已经是注册帐号了哦"),
    CODE_2209(2209, "参数错误，{0}"),
    CODE_2210(2210, "您的账号已被拉入黑名单！如有疑问，请联系客服。"),
    CODE_2211(2211, "您的账号已被删除！如有疑问，请联系客服。"),
    CODE_2212(2212, "该微信已经绑定了其他账号了哦"),
    CODE_2213(2213, "该账号已经绑定了其他微信了哦"),
    CODE_2214(2214, "你的帐号已经绑定的手机号码哦"),
    CODE_2215(2215, "操作超时，请重新验证原手机号"),
    CODE_2216(2216, "您的账号待审核，请耐心等待"),
    CODE_2217(2217, "账号状态异常，请联系客服"),
    CODE_2218(2218, "金额超出限制，不得超出下限值：{0}，上限值：{1}"),
    ///////////////////////素材相关//////////////////////
    CODE_2801(2801, "你已存在创作人申请信息,请勿重复提交"),
    CODE_2802(2802, "创作人申请信息不存在"),
    CODE_2803(2803, "您尚未成为创作人，不能出售素材"),
    CODE_2804(2804, "您尚未成为创作人"),
    CODE_2805(2805, "出售价格不能小于0元"),
    CODE_2806(2806, "该素材未在商城出售"),
    CODE_2807(2807, "您无法购买自己的素材"),
    CODE_2808(2808, "类型不存在"),
    CODE_2809(2809, "请选择类型"),
    CODE_2901(2901, "视频素材,缩略图不存在"),
    CODE_2902(2902, "素材不存在"),
    CODE_2903(2903, "请添加图片素材"),
    CODE_2904(2904, "请添加视频素材"),
    CODE_2905(2905, "请选择要删除的视频"),
    CODE_2906(2906, "请选择要删除的图片"),
    CODE_2907(2907, "请选择要删除的广告素材"),
    CODE_2908(2908, "请提供视频大小"),
    CODE_2909(2909, "视频大小应小于50MB"),
    CODE_2910(2910, "请提供图片大小"),
    CODE_2911(2911, "图片大小过大"),
    CODE_2912(2912, "您只能上传最多6张图片"),

    ///////////////////////用户账户//////////////////////
    CODE_3000(3000, "首次提现需大于1元"),
    CODE_3001(3001, "用户账户更新失败，请重新操作"),
    CODE_3002(3002, "您的收益余额不足"),
    CODE_3003(3003, "您的充值余额不足"),
    CODE_3004(3004, "提现失败，请重新操作"),
    CODE_3005(3005, "您的账户流水异常，请联系客服"),
    CODE_3006(3006, "您的提现已提交审核"),
    CODE_3007(3007, "你的时间网店暂未装修完毕,请前往完善资料,方可提现"),
    CODE_3008(3008, "您的微信未实名，请先去微信实名认证"),
    CODE_3009(3009, "您的微信付款次数超过限制，请明天再试"),
    CODE_3010(3010, "非首次提现需大于5元"),

    ///////////////////////开具发票//////////////////////
    CODE_3100(3100, "选中的红包有误，请重新操作"),
    CODE_3101(3101, "选中的红包有微信心意红包，需支付"),
    CODE_3102(3102, "月份选择错误"),
    CODE_3103(3103, "你该月的手续费已开票，请重新操作"),

    ///////////////////////联合支付//////////////////////
    CODE_3200(3200, "该支付方式不可用"),
    CODE_3201(3201, "余额不足，需充值"),
    CODE_3202(3202, "充值还未到账，请稍后"),

    ///////////////////////PC提现//////////////////////
    CODE_3300(3300, "银行卡不存在，请先绑定银行卡"),
    CODE_3301(3301, "低于最低提现额度"),
    CODE_3302(3302, "余额不足，请重新填写金额"),
    CODE_3303(3303, "您已绑定银行卡"),

    CODE_4000(4000, "素材信息异常"),
    CODE_5000(5000, "百米心意经纬度参数不能为空"),

    CODE_5100(5100, "五人约不存在"),
    CODE_5101(5101, "土豪派不存在"),
    CODE_5102(5102, "五人约已失效"),
    CODE_5103(5103, "五人约已满人"),
    CODE_5104(5104, "点心意不存在"),
    CODE_5105(5105, "五人约微信分享字典资料为空"),
    CODE_5106(5106, "用户分店不存在"),
    CODE_5107(5107, "非群主不能解散群"),
    CODE_5108(5108, "解散群失败"),

    CODE_60000(60000, "最小红包金额为{0}，最小红包个数为{1}"),
    CODE_60001(60001, "账户余额不足"),
    CODE_60002(60002, "批次不存在"),
    CODE_60003(60003, "网店不存在"),
    CODE_60004(60004, "非法领包"),
    CODE_60005(60005, "验证码错误"),
    CODE_60006(60006, "不满足领包条件"),
    CODE_60007(60007, "红包信息异常"),
    CODE_60008(60008, "非法关包"),
    CODE_60009(60009, "请在微信端领取此红包"),
    CODE_60010(60010, "请在心意红包APP端领取此红包"),
    CODE_60014(60014, "您已在广场存在3个全网/百米红包, 请不要继续发红包"),
    CODE_60011(60011, "不可将数据共享给{0}人"),
    CODE_60012(60012, "已被平台关闭，不可分享"),
    CODE_60013(60013, "红包已关闭"),
    CODE_60015(60015, "包已关闭，不能加钱"),
    CODE_60016(60016, "微信心意最小单包金额为1元"),
    CODE_60017(60017, "领包距离不足"),
    CODE_60018(60018, "领包时长不足"),
    CODE_60019(60019, "领包等级不足"),
    CODE_60020(60020, "不可将数据分享给本人"),
    CODE_60021(60021, "红包还在审核中，不可以进行操作哦~"),
    CODE_60022(60022, "审核未通过，请不要操作"),
    CODE_60023(60023, "每日时长任务已达上限，请明天再来"),
    CODE_60024(60024, "关包失败"),
    CODE_60025(60025, "专享包不允许分享"),
    CODE_60026(60026, "社交包请去社交页面发布"),
    CODE_60027(60027, "加钱失败"),

    CODE_21000(21000, "会员卡不存在"),
    CODE_21001(21001, "会员卡已过期"),

    CODE_70000(70000, "请先创建时间网店"),
    CODE_70001(70001,  "任务已完成"),

    CODE_80000(80000, "分配人数过多, 请重新分配"),
    CODE_80001(80001, "该批次已经没有未分配的现金券"),
    CODE_80002(80002, "需要填写登记信息"),
    CODE_80003(80003, "现金券已经被领完"),
    CODE_80004(80004, "此现金券数据异常"),
    CODE_80005(80005, "请勿重复领取"),
    CODE_80006(80006, "券不存在"),
    CODE_80007(80007, "该现金券没有对应的红包"),
    CODE_80008(80008, "官方券不允许申请加券"),
    CODE_80009(80009, "分配员工的数量不能小于1"),
    CODE_80010(80010, "该现金券不能用于此处"),
    CODE_80011(80011, "官方券不允许加钱"),
    CODE_80012(80012, "您已申请，请等待公司处理"),
    CODE_80013(80013, "该现金券已经使用"),
    CODE_80014(80014, "该现金券已经过期"),
    CODE_80015(80015, "该现金券已经关闭"),

    CODE_80016(80016, "活动不存在"),
    CODE_80017(80017, "初始化【日常宣传】和【心意红包平台赠送】活动失败"),
    CODE_80018(80018, "关闭的券不属于你, 请重新操作"),
    CODE_80019(80019, "照片数量不能超过6张"),
    CODE_80020(80020, "请输入正确的timeId！"),

    CODE_80021(80021, "该标签已被其他分店使用"),
    CODE_80022(80022, "该活动不属于登陆者"),
    CODE_80023(80023, "所选需要分配用户中已经存在拥有该批券的人, 请重新选择"),
    CODE_80024(80024, "请勿重复处理"),
    CODE_80025(80025, "心意红包最小红包金额为{0}"),
    CODE_80026(80026, "公司信息不存在"),


    //////////////////////////////////////jiangping 9号段专用//////////////////////////////////
    CODE_90000(90000, "请选择正确的类型");


    private int code;
    private String desc;

    ResponseCode(int code, String desc) {
        this.code = code;
        this.desc = desc;
    }


    public int getCode() {
        return code;
    }

    public String getDesc() {
        return desc;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public void setDesc(String desc) {
        this.desc = desc;
    }


    public static ResponseCode changeMethod(int code) {
        return Enum.valueOf(ResponseCode.class, "CODE_" + code);
    }
}
